Repository: rtfirst/llms-txt
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# extension.description
source: Generates compact llms.txt files for AI/LLM crawlers with page overview and access documentation
de: Generiert kompakte llms.txt-Dateien für AI/LLM-Crawler mit Seitenübersicht und Zugriffsdokumentation

source: Page Structure
de: Seitenstruktur

# settings.intro
source: Website description for llms.txt intro section
de: Website-Beschreibung für den Einleitungstext der llms.txt

# settings.excludePages
source: Comma-separated page UIDs to exclude from llms.txt
de: Komma-getrennte Seiten-UIDs, die von llms.txt ausgeschlossen werden

# settings.includeHidden
source: Include hidden pages in llms.txt
de: Versteckte Seiten in llms.txt einbeziehen

# settings.apiKey
source: API Key for protected access to ?format=clean/md endpoints
de: API-Schlüssel für geschützten Zugriff auf ?format=clean/md Endpunkte

# settings.apiKey.description
source: If set, the ?format=clean and ?format=md endpoints require this API key. Pass via X-LLM-API-Key header or api_key query parameter. Leave empty for public access.
de: Wenn gesetzt, erfordern die Endpunkte ?format=clean und ?format=md diesen API-Schlüssel. Übergabe via X-LLM-API-Key Header oder api_key Query-Parameter. Leer lassen für öffentlichen Zugriff.

# notification.robotsTxt.title
source: LLMs.txt: robots.txt configuration
de: LLMs.txt: robots.txt-Konfiguration

# notification.robotsTxt.message
source: The llms_txt extension recommends adding llms.txt references to your robots.txt file. See the extension documentation for details.
de: Die Extension llms_txt empfiehlt, Verweise auf llms.txt in Ihrer robots.txt-Datei hinzuzufügen. Details finden Sie in der Dokumentation der Extension.

# pages.tx_llmstxt_description
source: LLM Description
de: LLM-Beschreibung

# pages.tx_llmstxt_description.description
source: Special description for AI/LLM crawlers. If empty, the standard meta description is used.
de: Spezielle Beschreibung für AI/LLM-Crawler. Wenn leer, wird die Standard-Meta-Beschreibung verwendet.

# pages.tx_llmstxt_summary
source: LLM Summary
de: LLM-Zusammenfassung

# pages.tx_llmstxt_summary.description
source: Additional summary text for this page. Displayed as a quote block in llms.txt.
de: Zusätzlicher Zusammenfassungstext für diese Seite. Wird als Zitatblock in llms.txt angezeigt.

# pages.tx_llmstxt_keywords
source: LLM Keywords
de: LLM-Schlüsselwörter

# pages.tx_llmstxt_keywords.description
source: Comma-separated keywords/topics for this page, helping LLMs understand the content.
de: Komma-getrennte Schlüsselwörter/Themen für diese Seite, die LLMs helfen, den Inhalt zu verstehen.

# pages.tx_llmstxt_exclude
source: Exclude from llms.txt
de: Von llms.txt ausschließen

# pages.tx_llmstxt_exclude.description
source: If enabled, this page will not be included in the llms.txt file.
de: Wenn aktiviert, wird diese Seite nicht in die llms.txt-Datei aufgenommen.

# pages.tx_llmstxt_priority
source: LLM Priority
de: LLM-Priorität

# pages.tx_llmstxt_priority.description
source: Priority for this page (0-100). Higher values appear first in llms.txt. Default is 0 (normal sorting by page tree).
de: Priorität für diese Seite (0-100). Höhere Werte erscheinen zuerst in llms.txt. Standard ist 0 (normale Sortierung nach Seitenbaum).
